# Justification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..Justification Property
ColumnAttachment Class See Also
---
Identifies the type of justification to apply to this ColumnAttachment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ColumnAttachmentJustification Justification { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Justification As ColumnAttachmentJustification
	Get
```

Visual C++
---
```text
public:
property ColumnAttachmentJustification Justification {
	ColumnAttachmentJustification get ();
}
```

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace